"USSD_ERROR" = "执行请求时发生错误";
"USSD_TERMINATED" = "会话结束";

"%@ Call Forwarding\n%@\n%@%@" = "%2$@\n进行%1$@呼叫转移\n%3$@%4$@";
"%@ Call Waiting\n%@" = "%@呼叫等待\n%@";
"%@ Call Barring\n%@\n%@" = "%2$@\n进行%1$@呼叫限制\n%3$@";
"%@ Fixed Dialing\n%@" = "%2$@\n进行%1$@固定拨号";
"Connected Line Presentation\n%@" = "被叫号码显示\n%@";
"Calling Line Presentation\n%@" = "主叫号码显示\n%@";
"Connected Line ID Restriction\n%@" = "被叫号码不显示\n%@";
"Calling Line ID Restriction\n%@" = "主叫号码不显示\n%@";
"SIM Lock\n%@" = "SIM 卡锁定\n%@";
"Service Center Address\n%@" = "服务中心地址\n%@";
"Supplementary Service Password\n%@" = "附加服务的密码\n%@";
"Calling Name Presentation\n%@" = "主叫名称显示\n%@";

"Forwards to %@\n" = "转移到 %@\n";

"All Calls" = "所有呼叫";
"All Conditional Calls" = "所有有条件呼叫";
"Async Data Circuit" = "异步数据电路";
"Data" = "数据";
"Fax" = "传真";
"Packet Access" = "包访问";
"Pad Access" = "Pad 访问";
"SMS" = "短信";
"Sync Data Circuit" = "同步数据电路";
"Voice" = "语音";

"All Outgoing" = "所有呼出";
"All Incoming" = "所有呼入";
"Outgoing International" = "国际漫游呼出";
"Outgoing International, Except Home Country" = "对归属国以外地区的
国际漫游呼出";
"Incoming While Roaming Outside Home Country" = "对归属国境外漫游时的呼入";
"Incoming, Not On SIM" = "不在 SIM 卡上的呼入";
"All Services" = "所有服务";
"All Outgoing Services" = "所有呼出服务";
"All Incoming Services" = "所有呼入服务";

"Disabled" = "（已停用）";
"Enabled" = "（已启用）";

"On All Calls" = "所有呼叫";
"When Busy" = "占线时";
"When Unanswered" = "无人接听时";
"When Unreachable" = "无法接通时";

"Setting %@ Succeeded" = "%@成功\n";
"Setting Interrogation Succeeded" = "询问成功\n";
"Setting %@ Failed" = "%@失败\n";
"Setting Interrogation Failed" = "询问失败\n";

"Not Available" = "不可用";
"Network Controlled" = "网络控制";
"Temporarily Disabled" = "暂时停用";
"Temporarily Enabled" = "暂时启用";
"Unknown" = "未知";

"Activation" = "激活";
"Deactivation" = "停用";
"Interrogation" = "询问";
"Registration" = "注册";
"Erasure" = "抹掉";

"No Address" = "无地址";
"No Service Specified" = "未指定服务";
"Type %d" = "类型 %d";

// generic error
"CALL_FAILED" = "呼叫失败";
// error codes
"kCTNoError" = "无错误";
"kCTUnknownError" = "未知错误";
"kCTErrorRadioFailure" = "无线电失败";
// Generic network errors
"kCTErrorNetworkFailure" = "网络失败";
"kCTErrorCongestion" = "网络堵塞";
"kCTErrorUnidentifiedSubscriber" = "未识别的用户";
"kCTErrorFacilityRejected" = "设备被拒绝";
"kCTErrorUnknownSubscriber" = "未知用户";
"kCTErrorNetworkOutOfOrder" = "网络故障";
"kCTErrorInvalidTransactionIdentifier" = "交易识别码无效";
"kCTErrorSemanticallyIncorrectMessage" = "语义不正确的信息";
"kCTErrorInvalidMandatoryInformation" = "无效的强制信息";
"kCTErrorMessageTypeNonExistant" = "信息类型不存在";
"kCTErrorMessageNotCompatibleWithProtocolState" = "信息与协议状态不兼容";
"kCTErrorInformationElementNonExistant" = "信息元素不存在";
"kCTErrorProtocolErrorUnspecified" = "协议错误未指明";
"kCTErrorTemporaryFailure" = "暂时性失败";
"kCTErrorResourcesUnavailable" = "无可用资源";
"kCTErrorRequestedFacilityNotSubscribed" = "尚未订购请求的设备";
"kCTErrorRequestedFacilityNotImplemented" = "尚未设置请求的设备";
"kCTErrorInterworkingError" = "交互工作错误";
"kCTErrorInterworkingNotSupported" = "不支持交互工作";
"kCTErrorCommandCannotBeActioned" = "无法执行命令";
"kCTErrorNoNetworkService" = "无网络服务";
// Call related errors
"kCTErrorUnassignedNumber" = "未分配的号码";
"kCTErrorOperatorDeterminedBarring" = "运营商决定的限制";
"kCTErrorCallBarred" = "呼叫限制";
"kCTErrorUserBusy" = "用户正忙";
"kCTErrorNoUserResponding" = "用户未响应";
"kCTErrorNumberChanged" = "号码已更改";
"kCTErrorInvalidNumberFormat" = "号码格式无效";
"kCTErrorCallRejected" = "呼叫被拒绝";
// SIM errors
"kCTErrorSimNotInserted" = "未插入 SIM 卡";
"kCTErrorSimPinRequired" = "需要 SIM 卡 PIN 码";
"kCTErrorSimPukRequired" = "需要 SIM 卡 PUK 码";
"kCTErrorSimFailure" = "SIM 卡故障";
"kCTErrorSimMemoryFailure" = "SIM 卡内存故障";
"kCTBadPinFormatError" = "错误的 PIN 码格式";
"kCTErrorNumberNotAllowed" = "不允许数字";
"kCTErrorIncorrectPassword" = "密码不正确";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "文本信息传输被拒绝";
"kCTErrorDestinationOutOfOrder" = "目的地故障";
"kCTErrorClass0NotSupported" = "不支持级别 0";
"kCTErrorCannotReplaceSm" = "无法替换 SIM 卡";
"kCTErrorUnspecifiedPid" = "未指定的 PID";
"kCTErrorDataCodingSchemeNotSupported" = "不支持数据代码方案";
"kCTErrorUnspecifiedDcs" = "未指定的 DCS 错误";
"kCTErrorCommandUnsupported" = "不支持命令";
"kCTErrorUnspecifiedTpCommand" = "未指定的 TP 命令错误";
"kCTErrorTpduNotSupported" = "不支持 TPDU";
"kCTErrorScBusy" = "SC 正忙";
"kCTErrorRejectedBySimSmsControl" = "被 SIM 卡短信控制拒绝";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "GPRS 非法的 MS";
"kCTErrorGprsIllegalMe" = "GPRS 非法的 ME";
"kCTErrorGprsServicesNotAllowed" = "不允许 GPRS 服务";
"kCTErrorGprsPlmnNotAllowed" = "不允许 GPRS PLMN";
"kCTErrorGprsLocationAreaNotAllowed" = "不允许 GPRS 位置区";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "位置区内不允许 GPRS 漫游";
"kCTErrorGprsServiceOptionNotSupported" = "不支持 GPRS 服务选项";
"kCTErrorGprsServiceOptionNotSubscribed" = "未订购 GPRS 服务选项";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "GPRS 服务选项出现临时故障";
"kCTErrorGprsPdpAuthenticationFailure" = "GPRS PDP 鉴定失败";
"kCTErrorGprsInvalidMobileClass" = "GPRS 无效的移动级别";
"kCTErrorGprsUnspecified" = "未指定 GPRS";
"kCTErrorGprsMissingorUnknownAPN" = "缺少 GPRS 或 APN 未知";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "GPRS PDP 的鉴定信息被基带拒绝";
